# Location Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyPointPlacementReference..::..Location Property
FamilyPointPlacementReference Class See Also
---
The location of the point.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Transform Location { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Location As Transform
	Get
```

Visual C++
---
```text
public:
property Transform^ Location {
	Transform^ get ();
}
```

# See Also
FamilyPointPlacementReference Class
Autodesk.Revit.DB Namespace